

&НаСервере
Процедура ПричинаПовышенияРейтингаПриИзмененииНаСервере()
	Объект.Рейтинг =Объект.ПричинаПовышенияРейтинга.Стоимость;
	Элементы.Рейтинг.Доступность = Ложь;   
	Элементы.Комментарий.Видимость = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура ПричинаПовышенияРейтингаПриИзменении(Элемент)
	ПричинаПовышенияРейтингаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура РучнойВводРейтингаПриИзмененииНаСервере()
	Элементы.Рейтинг.Доступность = Истина;
	Объект.Рейтинг = 0; 
	Объект.ПричинаПовышенияРейтинга = "";  
	Элементы.Комментарий.Видимость = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РучнойВводРейтингаПриИзменении(Элемент)
	РучнойВводРейтингаПриИзмененииНаСервере();
КонецПроцедуры

