
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьВсеОтчеты();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВсеОтчеты()
	ЗаполнитьТоп();		
КонецПроцедуры


&Насервере
Процедура ЗаполнитьТоп()
	 Перем Место;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиРейтингаОстатки.Студент КАК Студент,
	|	ОстаткиРейтингаОстатки.РейтингОстаток КАК РейтингОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиРейтинга.Остатки КАК ОстаткиРейтингаОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	РейтингОстаток УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();   
	 Место = 0;    
	ТабЗнач = Новый ТаблицаЗначений; 
	ТабЗнач.Колонки.Добавить("Место");
	ТабЗнач.Колонки.Добавить("Студент");
	ТабЗнач.Колонки.Добавить("Рейтинг");
	Если Место <4 Тогда
		
	Для каждого Строка Из Таблица Цикл
		СтрокаТЗ = ТабЗнач.Добавить();
		СтрокаТЗ.Место = Строка(Место);
		СтрокаТЗ.Студент =   Строка.Студент;
		СтрокаТЗ.Рейтинг = Строка.РейтингОстаток;
		Место = Место+1;
	КонецЦикла;
	КонецЕсли;
	Топ10.Загрузить(ТабЗнач);
КонецПроцедуры




