
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьВсеОтчеты();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВсеОтчеты()
	ЗаполнитьТоп();	
	ЗаполнитьТопГрупп();
КонецПроцедуры

&Насервере
Процедура ЗаполнитьТопГрупп() 
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиРейтингаОстатки.Студент.Владелец КАК Группа,
		|	СУММА(ОстаткиРейтингаОстатки.РейтингОстаток) КАК Рейтинг
		|ИЗ
		|	РегистрНакопления.ОстаткиРейтинга.Остатки КАК ОстаткиРейтингаОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиРейтингаОстатки.Студент.Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рейтинг УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();   
	Место = 1;    
	ТабЗнач = Новый ТаблицаЗначений; 
	ТабЗнач.Колонки.Добавить("Место");
	ТабЗнач.Колонки.Добавить("Группа");
	ТабЗнач.Колонки.Добавить("ОбщийРейтингГруппы");
	
	Для каждого Строка Из Таблица Цикл  
		Если Место<11 Тогда
			
			СтрокаТЗ = ТабЗнач.Добавить();
			СтрокаТЗ.Место = Строка(Место);
			СтрокаТЗ.Группа =   Строка.Группа;
			СтрокаТЗ.ОбщийРейтингГруппы = Строка.Рейтинг;
			Место = Место+1;
			
		КонецЕсли;
		
	КонецЦикла;  
	ТопГрупп.Загрузить(ТабЗнач);
КонецПроцедуры



&Насервере
Процедура ЗаполнитьТоп()
	Перем Место;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиРейтингаОстатки.Студент КАК Студент,
	|	ОстаткиРейтингаОстатки.РейтингОстаток КАК РейтингОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиРейтинга.Остатки КАК ОстаткиРейтингаОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	РейтингОстаток УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();   
	Место = 1;    
	ТабЗнач = Новый ТаблицаЗначений; 
	ТабЗнач.Колонки.Добавить("МестоВТопе");
	ТабЗнач.Колонки.Добавить("Студент");
	ТабЗнач.Колонки.Добавить("Рейтинг");
	
	Для каждого Строка Из Таблица Цикл  
		Если Место<11 Тогда
			
			СтрокаТЗ = ТабЗнач.Добавить();
			СтрокаТЗ.МестоВТопе = Строка(Место);
			СтрокаТЗ.Студент =   Строка.Студент;
			СтрокаТЗ.Рейтинг = Строка.РейтингОстаток;
			Место = Место+1;
			
		КонецЕсли;
		
	КонецЦикла;  
	Топ10.Загрузить(ТабЗнач);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЗаполнитьВсеОтчеты();
КонецПроцедуры





