
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьВсеОтчеты();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВсеОтчеты()
	ОтчетАктивностьГрупп();		
КонецПроцедуры



&НаКлиенте
Процедура ОтчетАктивностьГрупп()
	
	ДиаграммаАктивностиГрупп.Очистить();
	ДиаграммаАктивностиГрупп.АвтоТранспонирование = ЛОЖЬ;
	ДиаграммаАктивностиГрупп.Обновление           = ЛОЖЬ;
	ДиаграммаАктивностиГрупп.ТипДиаграммы         = ТипДиаграммы.Гистограмма;
	
	ДиаграммаАктивностиГрупп.Серии.Добавить("Рейтинг студента");	
	ДанныеДиаграммы = ПолучитьДанныеДляОтчетаАктивностьГрупп();
	
	Для Сч = 0 По ДанныеДиаграммы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеДиаграммы["Запись" + Сч];
		Точка = ДиаграммаАктивностиГрупп.УстановитьТочку(Формат(ДанныеСтроки.Время,"ДЧ=ЧЧ"));
		
		ДиаграммаАктивностиГрупп.УстановитьЗначение(Точка
		, ДиаграммаАктивностиГрупп.Серии[0]
		, ДанныеСтроки.ПринятоЗаказов
		, Неопределено
		, "Рейтинг");   		
	КонецЦикла;
	
	ДиаграммаАктивностиГрупп.АвтоТранспонирование = Истина;
	ДиаграммаАктивностиГрупп.Обновление           = Истина;
	
КонецПроцедуры

Функция ПолучитьДанныеДляОтчетаАктивностьГрупп()
	
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ОстаткиРейтингаОстатки.РейтингОстаток) КАК РейтингОстаток,
		|	ОстаткиРейтингаОстатки.Студент.Владелец КАК СтудентВладелец,
		|	ОстаткиРейтингаОстатки.Студент КАК Студент
		|ИЗ
		|	РегистрНакопления.ОстаткиРейтинга.Остатки КАК ОстаткиРейтингаОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиРейтингаОстатки.Студент.Владелец,
		|	ОстаткиРейтингаОстатки.Студент
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтудентВладелец";
	
	РезультатЗапроса = Запрос.Выполнить();  	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ПрНомерЗаписи = 0;
	СтруктураДанных = Новый Структура;
	
	Для Каждого ТекСтрока Из ТаблицаЗначений Цикл 
		
		СтруктураСтроки = Новый Структура;   
		СтруктураСтроки.Вставить("ПринятоЗаказов", ТекСтрока.ПринятоЗаказов);
		СтруктураСтроки.Вставить("ВыданоЗаказов", ТекСтрока.ВыданоЗаказов);
		СтруктураДанных.Вставить("Запись" + Строка(ПрНомерЗаписи), СтруктураСтроки);
		
		ПрНомерЗаписи = ПрНомерЗаписи + 1;
		
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции
